app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%%')
---
  def index
  	@movies = Movie.all

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%a%')
SELECT "movies".* FROM "movies" WHERE (title LIKE '%a%')
---
  def search
  	# @ac = Movie.search(params[:q])
  	# render json: @ac.map(&:title).uniq
	@movies = Movie.where("title LIKE ?", "%" + params[:q] + "%")

	respond_to do |format|
		format.html
		format.json { @movies = Movie.search(params[:q]) }

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
	@movies = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@movies = Movie.find(params[:id])

INSERT INTO "movies" ("title", "rating", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
	@movies = Movie.new(movie_params)

	if @movies.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "movies" SET "rating" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["rating", "5.7"], ["updated_at", "2020-05-02 18:52:00.908221"], ["id", 1]]
---
  	def update
	  @movies = Movie.find(params[:id])

	  if @movies.update(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 6]]
---
	def destroy
	  @movies = Movie.find(params[:id])
	  @movies.destroy